Coding/Cpp/名字控制.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="zh-CN" xml:lang="zh-CN">
<head>
<title>名字控制</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="名字控制"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-12-14 09:03:03 CST"/>
<meta name="author" content="visayafan"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<div id="org-div-comments"><a href="../../index.html#cpp">主页</a></div>


</head>
<body>


<div id="content">
<h1 class="title">名字控制</h1>


<!-- <script type="text/javascript" src="https://ajax.googleapis.com/ajax/libs/jquery/1.7.1/jquery.min.js"> </script> -->
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/bootstrap_old.css" />
<link rel="stylesheet" type="text/css" href="../../Layout/CSS/style.css" />
<script src="../../Layout/JS/jquery_1.7.1.js"></script>
<script src="../../Layout/JS/bootstrap_old.js"></script>


<div id="table-of-contents">
<h2>目录</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 静态成员</a></li>
<li><a href="#sec-2">2 namespace</a></li>
<li><a href="#sec-3">3 静态数组和静态const初始化</a></li>
<li><a href="#sec-4">4 静态初始化的相依性</a>
<ul>
<li><a href="#sec-4-1">4.1 技术一：添加负责静态对象初始化的额外类</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> 静态成员</h2>
<div class="outline-text-2" id="text-1">

<ul>
<li>函数内静态成员只在函数第一次调用时初始化<br/>
</li>
<li>类中静态成员变量需要在类外初始化<br/>
</li>
<li>类中静态成员函数只能调用类中静态成员函数和静态成员变量<br/>
</li>
</ul>

</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> namespace</h2>
<div class="outline-text-2" id="text-2">

<p>  命名空间把全局名字空间分成多个可管理的小命令空间。<br/>
</p><ol>
<li>结尾不用分号<br/>
</li>
<li>命令空间可以赋值：<br/>
</li>
</ol>




<pre class="src src-c++"><span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">X</span>{
}
<span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">Y</span>=X;
</pre>


<pre class="src src-c++"><span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">X</span>{
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Y</span>{
        <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">i</span>;
    <span style="color: #a020f0;">public</span>:
        <span style="color: #0000ff;">Y</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">ii</span>){}
    };
    <span style="color: #a020f0;">class</span> <span style="color: #228b22;">Z</span>;
    <span style="color: #228b22;">void</span> <span style="color: #0000ff;">fun</span>();
}
<span style="color: #228b22;">int</span> <span style="color: #008b8b;">X</span>::<span style="color: #008b8b;">Y</span>::<span style="color: #a0522d;">i</span>=10;
<span style="color: #a020f0;">class</span> <span style="color: #008b8b;">X</span>::<span style="color: #228b22;">Z</span> {
    <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>;
<span style="color: #a020f0;">public</span>:
    <span style="color: #0000ff;">Z</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">xx</span>);
};
<span style="color: #008b8b;">X</span>::<span style="color: #008b8b;">Z</span>::<span style="color: #0000ff;">Z</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">xx</span>){x=xx;}
<span style="color: #228b22;">void</span> <span style="color: #008b8b;">X</span>::<span style="color: #0000ff;">fun</span>(){}
</pre>

<p>
  使用的2种方式：<br/>
</p><ol>
<li><code>using directive</code>  例如 using namespace Name;<br/>
</li>
<li><code>using declarationi</code> 例如：using Name::Fun;<br/>
</li>
</ol>

</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 静态数组和静态const初始化</h2>
<div class="outline-text-2" id="text-3">




<pre class="src src-c++"><span style="color: #a020f0;">class</span> <span style="color: #228b22;">Values</span>{
    <span style="color: #a020f0;">static</span> <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ary</span>[2];
    <span style="color: #a020f0;">static</span> <span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">ary2</span>[];
};
<span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #008b8b;">Values</span>::<span style="color: #a0522d;">ary</span>[2]={1,2};
<span style="color: #a020f0;">const</span> <span style="color: #228b22;">int</span> <span style="color: #008b8b;">Values</span>::<span style="color: #a0522d;">ary2</span>[]={1,2,3,4};
</pre>

</div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 静态初始化的相依性</h2>
<div class="outline-text-2" id="text-4">


</div>

<div id="outline-container-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> 技术一：添加负责静态对象初始化的额外类</h3>
<div class="outline-text-3" id="text-4-1">




<pre class="src src-c++"><span style="color: #b22222;">//</span><span style="color: #b22222;">Initializer.h</span>
<span style="color: #483d8b;">#if</span><span style="color: #483d8b;">n</span><span style="color: #483d8b;">def</span> INITIALIZER_H
<span style="color: #483d8b;">#define</span> <span style="color: #a0522d;">INITIALIZER_H</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">&lt;iostream&gt;</span>
<span style="color: #a020f0;">extern</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>;
<span style="color: #a020f0;">extern</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span>;
<span style="color: #a020f0;">class</span> <span style="color: #228b22;">Initializer</span>{
    <span style="color: #a020f0;">static</span> <span style="color: #228b22;">int</span> <span style="color: #a0522d;">initCount</span>;
<span style="color: #a020f0;">public</span>:
    <span style="color: #0000ff;">Initializer</span>(){
        <span style="color: #008b8b;">std</span>::cout&lt;&lt;<span style="color: #8b2252;">"Initizlizer()"</span>&lt;&lt;<span style="color: #008b8b;">std</span>::endl;
        <span style="color: #a020f0;">if</span>(initCount++ == 0){
            <span style="color: #008b8b;">std</span>::cout&lt;&lt;<span style="color: #8b2252;">"Performing Initizlization"</span>&lt;&lt;<span style="color: #008b8b;">std</span>::endl;
            x=100;
            y=100;
        }
    }
    ~<span style="color: #0000ff;">Initializer</span>(){
        <span style="color: #008b8b;">std</span>::cout&lt;&lt;<span style="color: #8b2252;">"~Initializer()"</span>&lt;&lt;<span style="color: #008b8b;">std</span>::endl;
        <span style="color: #a020f0;">if</span>(--initCount == 0){
            <span style="color: #008b8b;">std</span>::cout&lt;&lt;<span style="color: #8b2252;">"Performing cleanup"</span>&lt;&lt;<span style="color: #008b8b;">std</span>::endl;
        }
    }
};
<span style="color: #a020f0;">static</span> <span style="color: #228b22;">Initializer</span> <span style="color: #a0522d;">init</span>;
<span style="color: #483d8b;">#endif</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">Initializer.cpp</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"Initializer.h"</span>

<span style="color: #b22222;">//</span><span style="color: #b22222;">InitializerDefs.cpp</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"Initializer.h"</span>
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">x</span>;
<span style="color: #228b22;">int</span> <span style="color: #a0522d;">y</span>;
<span style="color: #228b22;">int</span> <span style="color: #008b8b;">Initializer</span>::<span style="color: #a0522d;">initCount</span>;

<span style="color: #b22222;">//</span><span style="color: #b22222;">InitializerMain.cpp</span>
<span style="color: #483d8b;">#include</span> <span style="color: #8b2252;">"Initializer.h"</span>
<span style="color: #a020f0;">using</span> <span style="color: #a020f0;">namespace</span> <span style="color: #008b8b;">std</span>;

<span style="color: #228b22;">int</span> <span style="color: #0000ff;">main</span>(<span style="color: #228b22;">int</span> <span style="color: #a0522d;">argc</span>, <span style="color: #228b22;">char</span> *<span style="color: #a0522d;">argv</span>[])
{
    cout&lt;&lt;<span style="color: #8b2252;">"inside main()"</span>&lt;&lt;endl;
    cout&lt;&lt;<span style="color: #8b2252;">"leaving main()"</span>&lt;&lt;endl;
    <span style="color: #a020f0;">return</span> 0;
}
</pre>

<p>
   每次包含 <code>Initializer.h</code> 时都会创建一个 <code>Initializer</code> 对象（因为是 <code>static</code> 类型的，所以不会出现重定义的现象），只有第一次才会执行x=100,y=100（因为第一次 initCount=0，而后自增），且只有最后一次析构才会执行if下的语句（每调用一次析构initCount自减，直到最后一次为0时执行if下语句）。<br/>
   这种方法所有做的有：<br/>
</p><ol>
<li>创建一个 <code>Initializer.h</code> 头文件，把想要进行初始工作的声明放在此处，并写一个类，类中声明静态类型计数器(作用是保证初始化工作只进行一次)，并声明一个该类的静态对象。<br/>
</li>
<li>在 <code>Initializer.cpp</code> 中 #include "Initializer.h" 并初始化 <code>Initializer.h</code> 中的计数器<br/>
</li>
<li>在main函数所在的文件中 #include "Initializer.h"<br/>
</li>
</ol>

<p>   这样就能保证变量在使用前肯定完成了初始化工作，与连接顺序无关了。<br/>
</p></div>
</div>
</div>
</div>

</body>
</html>
